In [1]:
import datetime

In [2]:
datetime.datetime.now()

datetime.datetime(2020, 6, 3, 6, 38, 11, 227272)

In [3]:
import datetime as dt

In [5]:
dt.datetime.now()

datetime.datetime(2020, 6, 3, 6, 40, 22, 983001)

In [12]:
import csv 
my_csv_file = 0
with open('fruits.csv') as csvfile: 
    my_csv_file = csv.reader(csvfile, delimiter=',') 
    for row in my_csv_file: 
        print(row)

['id', ' name', ' taste']
['1', ' mango', ' sour']
['2', ' apple', ' sweet']
['3', ' tamrind', ' bitter']

# Pandas Library

In [14]:
import pandas as pd

In [40]:
table1 = pd.read_csv('fruits.csv')

In [33]:
print(table1)

   id      name    taste
0   1     mango     sour
1   2     apple    sweet
2   3   tamrind   bitter

In [34]:
type(table1)

pandas.core.frame.DataFrame

In [35]:
table1.head()

   id      name    taste
0   1     mango     sour
1   2     apple    sweet
2   3   tamrind   bitter

In [36]:
table1.tail()

   id      name    taste
0   1     mango     sour
1   2     apple    sweet
2   3   tamrind   bitter

In [37]:
table1

   id      name    taste
0   1     mango     sour
1   2     apple    sweet
2   3   tamrind   bitter

In [93]:
table1[[' Name', ' Taste']]

       Name    Taste
0     mango     sour
1     apple    sweet
2   tamrind   bitter

In [60]:
data = {
    'mango' : [3,2,5,6],
    'apple' : [4,7,8,8],
    'pineapple' : [7,8,9,0],
    'Sour' : ['Apple','Mango','pineapple','sour']
}

In [61]:
type(data)

dict

In [62]:
purchase = pd.DataFrame(data)
type(purchase)

pandas.core.frame.DataFrame

In [63]:
purchase

   mango  apple  pineapple       Sour
0      3      4          7      Apple
1      2      7          8      Mango
2      5      8          9  pineapple
3      6      8          0       sour

In [48]:
purchase[['apple']]

   apple
0      4
1      7
2      8
3      8

In [49]:
purchase[['apple','mango']]

   apple  mango
0      4      3
1      7      2
2      8      5
3      8      6

In [64]:
purchase

   mango  apple  pineapple       Sour
0      3      4          7      Apple
1      2      7          8      Mango
2      5      8          9  pineapple
3      6      8          0       sour

In [65]:
purchase.iloc[ 0, 0 ]

3

In [66]:
purchase.iloc[1:2 ,2:3 ]

   pineapple
1          8

In [67]:
purchase.iloc[1:3 ,2:4 ]

   pineapple       Sour
1          8      Mango
2          9  pineapple

In [69]:
purchase.iloc[0:2 ,0:3 ]

   mango  apple  pineapple
0      3      4          7
1      2      7          8

In [70]:
data1 = {
    0 : [3,2,5,6],
    1 : [4,7,8,8],
    2 : [7,8,9,0],
    3: ['Apple','Mango','pineapple','sour']
}

In [71]:
df1 = pd.DataFrame(data1)

In [72]:
df1

   0  1  2          3
0  3  4  7      Apple
1  2  7  8      Mango
2  5  8  9  pineapple
3  6  8  0       sour

In [78]:
df1.iloc[2:4, : ]

   0  1  2          3
2  5  8  9  pineapple
3  6  8  0       sour

In [80]:
df1.iloc[ 2:4 , 0:4] # Row 2 and 3 &&& column  is 0,1,2,3

   0  1  2          3
2  5  8  9  pineapple
3  6  8  0       sour

In [83]:
df1.iloc[ 2:4 , 1:3] # to print 2 and 3 row + 1 and 2 column

   1  2
2  8  9
3  8  0

In [84]:
df1.sum()

0                         16
1                         27
2                         24
3    AppleMangopineapplesour
dtype: object

In [85]:
y = df1[0]

In [86]:
y

0    3
1    2
2    5
3    6
Name: 0, dtype: int64

In [87]:
type(y)

pandas.core.series.Series

In [88]:
df1

   0  1  2          3
0  3  4  7      Apple
1  2  7  8      Mango
2  5  8  9  pineapple
3  6  8  0       sour